In [1]:
import math
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from scipy import stats
import seaborn as sns
from pydataset import data

In [2]:
plt.rc('figure', figsize=(16, 9))
plt.rc('axes.spines', top=False, right=False)
plt.rc('patch', ec='black', force_edgecolor=True)
plt.rc('font', size=13)

np.random.seed(13)

### 1.In a jupyter notebook, classification_exercises.ipynb, use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.

In [ ]:
# print the first 3 rows
df_iris = data("iris")
df_iris.head(3)
# Another way to load the data set iris = sns.load_dataset('iris')

In [ ]:
# print the number of rows and columns (use attribute shape) 
df_iris.shape

In [ ]:
# print the column names
list(df_iris.columns.values)

In [ ]:
# print the column names
df_iris.columns.tolist()

In [ ]:
# print the data type of each column
df_iris.info()

In [ ]:
# print the summary statistics for each of the numeric variables. Would you recommend rescaling the data 
# based on these statistics? I would not rescale. The mean and std are not too far off
df_iris.describe() #.describe() method

### 2.Read the Table1_CustDetails table from the Excel_Exercises.xlsx file into a dataframe named df_excel.

assign the first 100 rows to a new dataframe, df_excel_sample
print the number of rows of your original dataframe
print the first 5 column names
print the column names that have a data type of object
compute the range for each of the numeric variables.

In [ ]:
#df_excel = pd.read_excel('Spreadsheets_Exercises.xlsx', sheet_name='Table1_CustDetails')
df_excel = pd.read_csv("Spreadsheets_Exercises.csv")
df_excel.head()

In [ ]:
# assign the first 100 rows to a new dataframe, df_excel_sample
df_excel_sample = df_excel.head(100)
df_excel_sample

In [ ]:
#print the number of rows of your original dataframe
df_excel.shape
# df_excel.index too

In [ ]:
# print the first 5 column names
df_excel.columns[:5]

In [ ]:
# print the column names that have a data type of object
df_excel.select_dtypes(include='object')

In [ ]:
# Using a list comprehension to get column names of oject type
[col for col in df_excel if df_excel[col].dtype == 'object']

In [ ]:
# Using a for loop to get column names of oject type
for col in df_excel:
    if df_excel[col].dtype == "object":
        print(col)

In [ ]:
# compute the range for each of the numeric variables
# select dtypes of numbers with a np array. Then get the range
numeric_vars = df_excel.select_dtypes(np.number)
numeric_range = numeric_vars.max() - numeric_vars.min()
numeric_range

### 3.Read the data from this google sheet into a dataframe, df_google

In [ ]:
# print the first 3 rows

sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'    

csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

df_googlesheet = pd.read_csv(csv_export_url)
df_googlesheet.head(3)

In [ ]:
# print the number of rows and columns
df_googlesheet.shape

In [ ]:
# print the column names. .columns attribute
df_googlesheet.columns

In [ ]:
# prints the columns to a list
df_googlesheet.columns.tolist()

In [ ]:
# print the data type of each column
df_googlesheet.info()

In [ ]:
# print the summary statistics for each of the numeric variables .T transposes
df_googlesheet.describe().T

In [ ]:
df_googlesheet.value_counts()

In [ ]:
# print the unique values for each of your categorical variables. the .dtypes attribute
for col in df_googlesheet:
    if df_googlesheet[col].dtypes == 'object':
        print(f'{col} has {df_googlesheet[col].nunique()} unique values.')

### Make a new python module, acquire.py to hold the following data aquisition functions:

### Make a function named get_titanic_data that returns the titanic data from the codeup data science database as a pandas data frame. Obtain your data from the Codeup Data Science Database.

In [3]:
# Import credentials from env. Also import os
from env import host, user, password
import os

In [ ]:
# establish mysql connection
def get_connection(db, user=user, host=host, password=password):
    return f'mysql+pymysql://{user}:{password}@{host}/{db}'

In [ ]:
# create a variable for sql query
def new_titanic_data():
    sql_query = 'SELECT * FROM passengers'
    df = pd.read_sql(sql_query, get_connection('titanic_db'))
    df.to_csv('titanic_df.csv')
    return df

In [ ]:
def get_titanic_data(cached=False):
    '''
    This function reads in titanic data from Codeup database if cached == False
    or if cached == True reads in titanic df from a csv file, returns df
    '''
    if cached or os.path.isfile('titanic_df.csv') == False:
        df = new_titanic_data()
    else:
        df = pd.read_csv('titanic_df.csv', index_col=0)
    return df

In [ ]:
titanic_df = get_titanic_data(cached=False)

In [ ]:
titanic_df.head()

Make a function named get_iris_data that returns the data from the iris_db on the codeup data science database as a pandas DataFrame. The returned DataFrame should include the actual name of the species in addition to the species_ids. Obtain your data from the Codeup Data Science Database.

In [ ]:
def new_iris_data():
    '''
    This function reads the iris data from the Codeup db into a df,
    writes it to a csv file, and returns the df.
    '''
    sql_query = """
                SELECT species_id,
                measurement_id
                species_name,
                sepal_length,
                sepal_width,
                petal_length,
                petal_width
                FROM measurements
                JOIN species
                USING(species_id)
                """
    df = pd.read_sql(sql_query, get_connection('iris_db'))
    df.to_csv('iris_df.csv')
    return df

In [ ]:
def get_iris_data(cached=False):
    '''
    This function reads in iris data from Codeup database if cached == False
    or if cached == True reads in iris df from a csv file, returns df
    '''
    if cached or os.path.isfile('iris_df.csv') == False:
        df = new_iris_data()
    else:
        df = pd.read_csv('iris_df.csv', index_col=0)
    return df

In [ ]:
iris_df = get_iris_data(cached=False)

In [ ]:
iris_df.head()

# Data Preperation Exercise
### The end product of this exercise should be the specified functions in a python script named prepare.py. Do these in your classification_exercises.ipynb first, then transfer to the prepare.py file.

This work should all be saved in your local classification-exercises repo. Then add, commit, and push your changes.

### Iris Data

 - Use the function defined in acquire.py to load the iris data.
 - Drop the species_id and measurement_id columns.
 - Rename the species_name column to just species.
 - Create dummy variables of the species name.
 - Create a function named prep_iris that accepts the untransformed iris data, and returns the data with the transformations above applied.

In [4]:
#Importing acquire file created
import acquire
from acquire import get_iris_data

In [ ]:
# A. Use the function defined in acquire.py to load the iris data. 
# Creating irisdf using the cached file created
irisdf = get_iris_data()
irisdf.head()

In [ ]:
# B. Drop the species_id and measurement_id columns.
cols_to_drop = ['species_id','measurement_id']
irisdf = irisdf.drop(columns=cols_to_drop)

In [ ]:
irisdf

In [ ]:
# C. Rename the species_name column to just species.
irisdf = irisdf.rename({'species_name':'species'}, axis = 1)
irisdf

In [ ]:
# D. Create dummy variables of the species name.
dummy_df = pd.get_dummies(irisdf[['species']], dummy_na=False)
dummy_df

In [ ]:
# Now going to concat the irisdf and dummy_df
irisdf = pd.concat([irisdf, dummy_df], axis = 1)
irisdf

In [ ]:
# Create a function named prep_iris that accepts the untransformed iris data, and returns
# the data with the transformations above applied.
def prep_iris(irisdf):
    '''
    This function acquires and prepares the iris data from a local csv, default.
    Passing cached=False acquires fresh data from Codeup db and writes to csv.
    Returns the iris df with dummy variables encoding species.
    '''
    # use my aquire function to read data into a df from a csv file
    irisdf = get_iris_data(cached)
    cols_to_drop = ['species_id','measurement_id']
    irisdf = irisdf.drop(columns=cols_to_drop)
    irisdf = irisdf.rename({'species_name':'species'}, axis = 1)
    dummy_df = pd.get_dummies(irisdf[['species']], dummy_na=False)
    irisdf = pd.concat([irisdf, dummy_df], axis = 1)
    return irisdf

# Titanic Data

## Use the function you defined in acquire.py to load the titanic data set.
- A. Handle the missing values in the embark_town and embarked columns.
- B. Remove the deck column.
- C. Create a dummy variable of the embarked column.
- D. Scale the age and fare columns using a min max scaler. Why might this be beneficial? When might you not want to do this?
- E. Fill the missing values in age. The way you fill these values is up to you. Consider the tradeoffs of different methods.
- F. Create a function named prep_titanic that accepts the untransformed titanic data, and returns the data with the transformations above applied.

In [6]:
# accessing the acquire file and importing the function
from acquire import get_titanic_data

In [7]:
# Creating a df from the acquire file
titanic_df = get_titanic_data()
titanic_df.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

In [8]:
# A. Handle the missing values in the embark_town and embarked columns. Shows 889 values
# for both embark_town and embarked column. Should be 891 so missing 2
titanic_df.info()
titanic_df.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 0 to 890
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   passenger_id  891 non-null    int64
 1   survived      891 non-null    int64
 2   pclass        891 non-null    int64
 3   sex           891 non-null    object
 4   age           714 non-null    float64
 5   sibsp         891 non-null    int64
 6   parch         891 non-null    int64
 7   fare          891 non-null    float64
 8   embarked      889 non-null    object
 9   class         891 non-null    object
 10  deck          203 non-null    object
 11  embark_town   889 non-null    object
 12  alone         891 non-null    int64
dtypes: float64(2), int64(6), object(5)
memory usage: 97.5+ KB

passenger_id      0
survived          0
pclass            0
sex               0
age             177
sibsp             0
parch             0
fare              0
embarked          2
class             0
deck            688
embark_town       2
alone             0
dtype: int64

In [9]:
# A. Handle the missing values in the embark_town and embarked columns.
# the ~ with the isnull() method will remove the null values
titanic_df = titanic_df[~titanic_df.embark_town.isnull()]
titanic_df = titanic_df[~titanic_df.embarked.isnull()]
titanic_df.isnull().sum()

passenger_id      0
survived          0
pclass            0
sex               0
age             177
sibsp             0
parch             0
fare              0
embarked          0
class             0
deck            688
embark_town       0
alone             0
dtype: int64

In [10]:
# B. Remove the deck column.
cols_to_drop = ['deck']
titanic_df = titanic_df.drop(columns=cols_to_drop)
titanic_df.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,Southampton,1

In [11]:
# C. Create a dummy variable of the embarked column.
df_dummy = pd.get_dummies(titanic_df[['embarked']], dummy_na=False)
df_dummy.head()
# Now we want to concat the dummy df to the original df.
titanic_df = pd.concat([titanic_df, df_dummy], axis = 1)
titanic_df.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,embark_town,alone,embarked_C,embarked_Q,embarked_S
0,0,0,3,male,22.0,1,0,7.2500,S,Third,Southampton,0,0,0,1
1,1,1,1,female,38.0,1,0,71.2833,C,First,Cherbourg,0,1,0,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,Southampton,1,0,0,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,Southampton,0,0,0,1
4,4,0,3,male,35.0,0,0,8.0500,S,Third,Southampton,1,0,0,1

In [12]:
# You first want to train, validate, test and split data
from sklearn.model_selection import train_test_split

def titanic_split(df):
    '''
    This function performs split on titanic data, stratify survived.
    Returns train, validate, and test dfs.
    '''
    train_validate, test = train_test_split(titanic_df, test_size=.2, 
                                        random_state=123, 
                                        stratify=titanic_df.survived)

    train, validate = train_test_split(train_validate, test_size=.3, 
                                   random_state=123, 
                                   stratify=train_validate.survived)
    return train, validate, test

In [17]:
# Now you can see the shaped of each train, validate, and split
print(f'train -> {train.shape}')
print(f'validate -> {validate.shape}')
print(f'test -> {test.shape}')

train -> (497, 15)
validate -> (214, 15)
test -> (178, 15)

In [18]:
train.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,embark_town,alone,embarked_C,embarked_Q,embarked_S
583,583,0,1,male,36.0,0,0,40.1250,C,First,Cherbourg,1,1,0,0
337,337,1,1,female,41.0,0,0,134.5000,C,First,Cherbourg,1,1,0,0
50,50,0,3,male,7.0,4,1,39.6875,S,Third,Southampton,0,0,0,1
218,218,1,1,female,32.0,0,0,76.2917,C,First,Cherbourg,1,1,0,0
31,31,1,1,female,NaN,1,0,146.5208,C,First,Cherbourg,0,1,0,0

In [13]:
# Importing skylearn minmaxscaler
from sklearn.preprocessing import LabelEncoder, OneHotEncoder, MinMaxScaler

In [ ]:
# D. Scale the age and fare columns using a min max scaler. Why might this be beneficial?
# When might you not want to do this?
scaler = MinMaxScaler()
scaler.fit(titanic_df[["age"]])
titanic_df.age = scaler.transform(titanic_df[["age"]])

scaler.fit(titanic_df[["fare"]])
titanic_df.fare = scaler.transform(titanic_df[["fare"]])

titanic_df

In [19]:
# E. Fill the missing values in age. The way you fill these values is up to you. 
# Consider the tradeoffs of different methods.
from sklearn.impute import SimpleImputer
import warnings

warnings.filterwarnings("ignore")

imputer = SimpleImputer(strategy = 'mean')

train["age"] = imputer.fit_transform(train[['age']])

# Checking to see if the nulls were taken care of. Yep
train['age'].isnull().sum()

0

In [22]:
# Transform the validate and test df age columns

validate['age'] = imputer.transform(validate[['age']])
test['age'] = imputer.transform(test[['age']])

In [23]:
# Helper function for imputing. Putting everything done for imputing here
def impute_age(train, validate, test):
    '''
    This function imputes the mean of the age column into
    observations with missing values.
    Returns transformed train, validate, and test df.
    '''
    # create the imputer object with mean strategy
    imputer = SimpleImputer(strategy = 'mean')
    
    # fit on and transform age column in train
    train['age'] = imputer.fit_transform(train[['age']])
    
    # transform age column in validate
    validate['age'] = imputer.transform(validate[['age']])
    
    # transform age column in test
    test['age'] = imputer.transform(test[['age']])
    
    return train, validate, test

In [ ]:
# F. Create a function named prep_titanic that accepts the untransformed titanic data, 
# and returns the data with the transformations above applied.

def prep_titanic(titanic_df):
    '''
    This function reads titanic data into a df from a csv file.
    Returns prepped train, validate, and test dfs
    '''
    # use my acquire function to read data into a df from a csv file
    df = get_titanic_data(cached)
    
    # drop rows where embarked/embark town are null values
    df = df[~df.embarked.isnull()]
    
    # encode embarked using dummy columns
    titanic_dummies = pd.get_dummies(df.embarked, drop_first=True)
    
    # join dummy columns back to df
    df = pd.concat([df, titanic_dummies], axis=1)
    
    # drop the deck column
    df = df.drop(columns='deck')
    
    # split data into train, validate, test dfs
    train, validate, test = titanic_split(df)
    
    # impute mean of age into null values in age column
    train, validate, test = impute_age(train, validate, test)
    
    return train, validate, test